01  WS-AREA-1 PIC X(100). 01  WS-AREA-2 PIC X(100). 88 WS-FLAG VALUE 'Y'. 01 WS-CONTROL PIC X. MOVE 'Y' TO WS-CONTROL. IF WS-FLAG = 'Y' THEN PERFORM A-PARA ELSE PERFORM B-PARA END-IF. A-PARA. MOVE 'Hello' TO WS-AREA-1. B-PARA. MOVE 'World' TO WS-AREA-2. DISPLAY WS-AREA-1 WS-AREA-2.